In [1]:
import numpy as np
import pandas as pd
stuff={'corporation':['apple','google','meta','apple','google','meta'],
       'names':['john','jacob','julie','ron','aaron','may'],
       'salary':[110,200,220,300,400,450]}
my_df=pd.DataFrame(stuff)

In [2]:
my_df

  corporation  names  salary
0       apple   john     110
1      google  jacob     200
2        meta  julie     220
3       apple    ron     300
4      google  aaron     400
5        meta    may     450

In [3]:
def times1000(x):
    return x*1000

In [5]:
pd.DataFrame(my_df['salary'].apply(times1000))

   salary
0  110000
1  200000
2  220000
3  300000
4  400000
5  450000